Highlighted geometry contains a path or edge that could not be divided.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DividedPathCannotCreateFromGeometry { get; }
  Visual Basic
Public Shared ReadOnly Property DividedPathCannotCreateFromGeometry As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DividedPathCannotCreateFromGeometry {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DividedPathFailures Class
  Autodesk.Revit.DB Namespace